/* NSManagedObjectContextLockingError */
"Err132000" = "Could not acquire a lock in a managed object context.";

/* NSPersistentStoreCoordinatorLockingError */
"Err132010" = "Could not acquire a lock in a managed persistent store coordinator.";

/* NSMangedObjectReferentialIntegrityError */
"Err133000" = "Attempt to access an object not found in store.";

/* NSManagedObjectExternalRelationshipError */
"Err133010" = "Cannot save objects with references outside of their own stores.";

/* NSManagedObjectMergeError */
"Err133020" = "Could not merge changes.";

/* NSPersistentStoreInvalidTypeError */
"Err134000" = "Failed to save. Unknown store type, format, or version.";

/* NSPersistentStoreTypeMismatchError */
"Err134010" = "The store type is inconsistent with the data format.";

/* NSPersistentStoreIncompatibleSchemaError */
"Err134020" = "The model configuration used to open the store is incompatible with the one that was used to create the store.";

/* NSPersistentStoreSaveError */
"Err134030" = "An error occurred while saving.";

/* NSPersistentStoreIncompleteSaveError */
"Err134040" = "Save operation could not be completed.";

/* NSCoreDataError */
"Err134060" = "A Core Data error occurred.";

/* NSPersistentStoreOperationError */
"Err134070" = "An error occurred in the persistent store.";

/* NSPersistentStoreOpenError */
"Err134080" = "An error occurred while opening the persistent store.";

/* NSPersistentStoreTimeoutError */
"Err134090" = "A timeout error occurred while connecting to the persistent store.";

/* NSPersistentStoreIncompatibleVersionHashError */
"Err134100" = "The managed object model version used to open the persistent store is incompatible with the one that was used to create the persistent store.";

/* NSMigrationError */
"Err134110" = "An error occurred during persistent store migration.";

/* NSMigrationCancelledError */
"Err134120" = "Persistent store migration was cancelled before completion.";

/* NSMigrationMissingSourceModelError */
"Err134130" = "Persistent store migration failed, missing source managed object model.";

/* NSMigrationMissingMappingModelError */
"Err134140" = "Persistent store migration failed, missing mapping model.";

/* NSMigrationManagerSourceStoreError */
"Err134150" = "Persistent store migration failed, there was a problem with the source persistent store.";

/* NSMigrationManagerDestinationStoreError */
"Err134160" = "Persistent store migration failed, there was a problem with the destination persistent store.";

/* NSEntityMigrationPolicyError */
"Err134170" = "Persistent store migration failed while processing entity migration policy.";

/* NSSQLiteError */
"Err134180" = "An SQLite error occurred.";
                         
/* NSManagedObjectValidationError */
"Err1550" = "%{PROPERTY}@ is not valid.";

/* NSValidationMultipleErrorsError */
"Err1560" = "Multiple validation errors occurred.";

/* NSValidationMissingMandatoryPropertyError */
"Err1570" = "%{PROPERTY}@ is a required value.";

/* NSValidationRelationshipLacksMinimumCountError */
"Err1580" = "Too few items in %{PROPERTY}@.";

/* NSValidationRelationshipExceedsMaximumCountError */
"Err1590" = "Too many items in %{PROPERTY}@.";

/* NSValidationRelationshipDeniedDeleteError */
"Err1600" = "Items cannot be deleted from %{PROPERTY}@.";

/* NSValidationNumberTooLargeError */
"Err1610" = "%{PROPERTY}@ is too large.";

/* NSValidationNumberTooSmallError */
"Err1620" = "%{PROPERTY}@ is too small.";

/* NSValidationDateTooLateError */
"Err1630" = "%{PROPERTY}@ is too late.";

/* NSValidationDateTooSoonError */
"Err1640" = "%{PROPERTY}@ is too soon.";

/* NSValidationInvalidDateError */
"Err1650" = "%{PROPERTY}@ is invalid.";

/* NSValidationStringTooLongError */
"Err1660" = "%{PROPERTY}@ is too long.";

/* NSValidationStringTooShortError */
"Err1670" = "%{PROPERTY}@ is too short.";

/* NSValidationStringPatternMatchingError */
"Err1680" = "%{PROPERTY}@ is invalid.";

